protogia/avr-descriptionfiles-4-nim/svd/ATmega2564RFR2.atdf.svd
        <register>
          <name>PARCR</name>
          <description>Power Amplifier Ramp up/down Control Register</description>
          <addressOffset>0x7A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARUFI</name>
              <description>Power Amplifier Ramp Up Frequency Inversion</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARDFI</name>
              <description>Power Amplifier Ramp Down Frequency Inversion</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PALTU</name>
              <description>ext. PA Ramp Up Lead Time</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PALTU_MINUS_3US</name>
                  <description>-3us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_MINUS_2US</name>
                  <description>-2us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_MINUS_1US</name>
                  <description>-1us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_0US</name>
                  <description>0us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_1US</name>
                  <description>1us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_2US</name>
                  <description>2us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_3US</name>
                  <description>3us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTU_4US</name>
                  <description>4us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PALTD</name>
              <description>ext. PA Ramp Down Lead Time</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PALTD_MINUS_3US</name>
                  <description>-3us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_MINUS_2US</name>
                  <description>-2us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_MINUS_1US</name>
                  <description>-1us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_0US</name>
                  <description>0us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_1US</name>
                  <description>1us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_2US</name>
                  <description>2us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_3US</name>
                  <description>3us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PALTD_4US</name>
                  <description>4us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PART_NUM</name>
          <description>Device Identification Register (Part Number)</description>
          <addressOffset>0x9E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PART_NUM</name>
              <description>Part Number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P_ATmega128RFA1</name>
                  <description>ATmega128RFA1 part number</description>
                  <value>131</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_RFA2</name>
                  <description>RFA2 family</description>
                  <value>147</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_RFR2</name>
                  <description>RFR2 family</description>
                  <value>148</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_CC_CCA</name>
          <description>Transceiver Clear Channel Assessment (CCA) Control Register</description>
          <addressOffset>0x8A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>RX/TX Channel Selection</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>F_2405MHZ</name>
                  <description>2405 MHz</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2410MHZ</name>
                  <description>2410 MHz</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2415MHZ</name>
                  <description>2415 MHz</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2420MHZ</name>
                  <description>2420 MHz</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2425MHZ</name>
                  <description>2425 MHz</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2430MHZ</name>
                  <description>2430 MHz</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2435MHZ</name>
                  <description>2435 MHz</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2440MHZ</name>
                  <description>2440 MHz</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2445MHZ</name>
                  <description>2445 MHz</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2450MHZ</name>
                  <description>2450 MHz</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2455MHZ</name>
                  <description>2455 MHz</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2460MHZ</name>
                  <description>2460 MHz</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2465MHZ</name>
                  <description>2465 MHz</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2470MHZ</name>
                  <description>2470 MHz</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2475MHZ</name>
                  <description>2475 MHz</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F_2480MHZ</name>
                  <description>2480 MHz</description>
                  <value>26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_MODE</name>
              <description>Select CCA Measurement Mode</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_CS_OR_ED</name>
                  <description>Mode 3a, Carrier sense OR energy above threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_ED</name>
                  <description>Mode 1, Energy above threshold</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_CS</name>
                  <description>Mode 2, Carrier sense only</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_CS_AND_ED</name>
                  <description>Mode 3b, Carrier sense AND energy above threshold</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_REQUEST</name>
              <description>Manual CCA Measurement Request</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_ED_LEVEL</name>
          <description>Transceiver Energy Detection Level Register</description>
          <addressOffset>0x89</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ED_LEVEL</name>
              <description>Energy Detection Level</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ED_MIN</name>
                  <description>Minimum result of last ED measurement</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_MIN_PLUS_1dB</name>
                  <description>P(RF) = RSSI_BASE_VAL+ED [dBm]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_MAX</name>
                  <description>Maximum result of last ED measurement</description>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ED_RESET</name>
                  <description>Reset value</description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_RSSI</name>
          <description>Receiver Signal Strength Indicator Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSSI</name>
              <description>Receiver Signal Strength Indicator</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSSI_MIN</name>
                  <description>Minimum RSSI value: P(RF) &lt; -90 dBm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSSI_MIN_PLUS_3dB</name>
                  <description>P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_2</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSSI_MAX</name>
                  <description>Maximum RSSI value: P(RF) ≥ -10 dBm</description>
                  <value>28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RND_VALUE</name>
              <description>Random Value</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_CRC_VALID</name>
              <description>Received Frame CRC Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_INVALID</name>
                  <description>CRC (FCS) not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_VALID</name>
                  <description>CRC (FCS) valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_TX_PWR</name>
          <description>Transceiver Transmit Power Control Register</description>
          <addressOffset>0x87</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_PWR</name>
              <description>Transmit Power Setting</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3_5_DBM</name>
                  <description>3.5 dBm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_3_DBM</name>
                  <description>3.3 dBm</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_8_DBM</name>
                  <description>2.8 dBm</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_3_DBM</name>
                  <description>2.3 dBm</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_8_DBM</name>
                  <description>1.8 dBm</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_2_DBM</name>
                  <description>1.2 dBm</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_5_DBM</name>
                  <description>0.5 dBm</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_5_DBM</name>
                  <description>-0.5 dBm</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_5_DBM</name>
                  <description>-1.5 dBm</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_5_DBM</name>
                  <description>-2.5 dBm</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_5_DBM</name>
                  <description>-3.5 dBm</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_5_DBM</name>
                  <description>-4.5 dBm</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_5_DBM</name>
                  <description>-6.5 dBm</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_5_DBM</name>
                  <description>-8.5 dBm</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11_5_DBM</name>
                  <description>-11.5 dBm</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_5_DBM</name>
                  <description>-16.5 dBm</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CF</name>
          <description>Transceiver Center Frequency Calibration Control Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_CF_START</name>
              <description>Start Center Frequency Calibration</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_DCU</name>
          <description>Transceiver Delay Cell Calibration Control Register</description>
          <addressOffset>0x9D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_DCU_START</name>
              <description>Start Delay Cell Calibration</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CTRL</name>
          <description>Transceiver Receive Control Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PDT_THRES</name>
              <description>Receiver Sensitivity Control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDT_THRES_ANT_DIV_ON</name>
                  <description>Recommended correlator threshold for Antenna Diversity operation</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDT_THRES_ANT_DIV_OFF</name>
                  <description>Reset value, to be used if Antenna Diversity algorithm is disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
