protogia/avr-descriptionfiles-4-nim/svd/ATmega2564RFR2.atdf.svd
        <register>
          <name>TRX_STATUS</name>
          <description>Transceiver Status Register</description>
          <addressOffset>0x83</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRX_STATUS</name>
              <description>Transceiver Main Status</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P_ON</name>
                  <description>P_ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_RX</name>
                  <description>BUSY_RX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_TX</name>
                  <description>BUSY_TX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ON</name>
                  <description>RX_ON</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRX_OFF</name>
                  <description>TRX_OFF</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_ON</name>
                  <description>PLL_ON</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>SLEEP</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_RX_AACK</name>
                  <description>BUSY_RX_AACK</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY_TX_ARET</name>
                  <description>BUSY_TX_ARET</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_AACK_ON</name>
                  <description>RX_AACK_ON</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_ARET_ON</name>
                  <description>TX_ARET_ON</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATE_TRANSITION_IN_PROGRESS</name>
                  <description>STATE_TRANSITION_IN_PROGRESS</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TST_STATUS</name>
              <description>Test mode status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TST_DISABLED</name>
                  <description>Test mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TST_ENABLED</name>
                  <description>Test mode is active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_STATUS</name>
              <description>CCA Status Result</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_BUSY</name>
                  <description>Channel indicated as busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_IDLE</name>
                  <description>Channel indicated as idle.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_DONE</name>
              <description>CCA Algorithm Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA_NOT_FIN</name>
                  <description>CCA calculation not finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_FIN</name>
                  <description>CCA calculation finished</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST_CTRL_DIGI</name>
          <description>Transceiver Digital Test Control Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TST_CTRL_DIG</name>
              <description>Digital Test Controller Register</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_NO_TEST_IS_ACTIVE</name>
                  <description>NORMAL (no test is active)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TST_CONT_TX_CONTINUOUS_TRANSMIT</name>
                  <description>TST_CONT_TX (continuous transmit)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST_RX_LENGTH</name>
          <description>Transceiver Received Frame Length Register</description>
          <addressOffset>0xBD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX_LENGTH</name>
              <description>Received Frame Length</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION_NUM</name>
          <description>Device Identification Register (Version Number)</description>
          <addressOffset>0x9F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VERSION_NUM</name>
              <description>Version Number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV_B</name>
                  <description>Revision B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_C</name>
                  <description>Revision C</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_D</name>
                  <description>Revision D</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_A</name>
                  <description>Revision A</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VREG_CTRL</name>
          <description>Voltage Regulator Control and Status Register</description>
          <addressOffset>0x92</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DVDD_OK</name>
              <description>DVDD Supply Voltage Valid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIGITAL_VOLTAGE_REGULATOR_DISABLED_OR_SUPPLY_VOLTAGE_NOT_STABLE</name>
                  <description>Digital voltage regulator disabled or supply voltage not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_SUPPLY_VOLTAGE_HAS_SETTLED</name>
                  <description>Digital supply voltage has settled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVREG_EXT</name>
              <description>Use External DVDD Regulator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVDD_INT</name>
                  <description>Internal DVDD voltage regulator for the digital section is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVDD_EXT</name>
                  <description>Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDD_OK</name>
              <description>AVDD Supply Voltage Valid</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANALOG_VOLTAGE_REGULATOR_DISABLED_OR_SUPPLY_VOLTAGE_NOT_STABLE</name>
                  <description>Analog voltage regulator disabled or supply voltage not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_SUPPLY_VOLTAGE_HAS_SETTLED</name>
                  <description>Analog supply voltage has settled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVREG_EXT</name>
              <description>Use External AVDD Regulator</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDD_INT</name>
                  <description>Internal AVDD voltage regulator for the analog section is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDD_EXT</name>
                  <description>Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XAH_CTRL_0</name>
          <description>Transceiver Extended Operating Mode Control Register</description>
          <addressOffset>0xAE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLOTTED_OPERATION</name>
              <description>Set Slotted Acknowledgment</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOTTED_OP_DIS</name>
                  <description>The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOTTED_OP_EN</name>
                  <description>The transmission of an acknowledgment frame has to be controlled by the microcontroller.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_CSMA_RETRIES</name>
              <description>Maximum Number of CSMA-CA Procedure Repetition Attempts</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REPETITION_OF_CSMA_CA_PROCEDURE</name>
                  <description>No repetition of CSMA-CA procedure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_REPETITION_OF_CSMA_CA_PROCEDURE</name>
                  <description>One repetition of CSMA-CA procedure</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE_REPETITIONS_HIGHEST_IEEE_802_15_4_COMPLIANT_VALUE</name>
                  <description>Five repetitions (highest IEEE 802.15.4 compliant value)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMMEDIATE_FRAME_RE_TRANSMISSION_WITHOUT_PERFORMING_CSMA_CA</name>
                  <description>Immediate frame re-transmission without performing CSMA-CA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_FRAME_RETRIES</name>
              <description>Maximum Number of Frame Re-transmission Attempts</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_NOT_ATTEMPTED</name>
                  <description>Retransmission of frame is not attempted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_ONCE</name>
                  <description>Retransmission of frame is attempted once.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_15_TIMES</name>
                  <description>Retransmission of frame is attempted 15 times.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XAH_CTRL_1</name>
          <description>Transceiver Acknowledgment Frame Control Register 1</description>
          <addressOffset>0x99</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AACK_PROM_MODE</name>
              <description>Enable Promiscuous Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_ACK_TIME</name>
              <description>Reduce Acknowledgment Time</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AACK_ACK_TIME_12_SYM</name>
                  <description>12 symbols acknowledgment time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AACK_ACK_TIME_2_SYM</name>
                  <description> 2 symbols acknowledgment time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AACK_UPLD_RES_FT</name>
              <description>Process Reserved Frames</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_FLTR_RES_FT</name>
              <description>Filter Reserved Frames</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC_CTRL</name>
          <description>Crystal Oscillator Control Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XTAL_TRIM</name>
              <description>Crystal Oscillator Load Capacitance Trimming</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_TRIM_MIN</name>
                  <description>0.0 pF, trimming capacitors disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x1</name>
                  <description>0.3 pF, trimming capacitor switched on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x2</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_TRIM_MAX</name>
                  <description>4.5 pF, trimming capacitor switched on</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_MODE</name>
              <description>Crystal Oscillator Operating Mode</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL_CRYSTAL_OSCILLATOR_DISABLED_USE_EXTERNAL_REFERENCE_FREQUENCY</name>
                  <description>Internal crystal oscillator disabled; use external reference frequency.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL_CRYSTAL_OSCILLATOR_ENABLED_AMPLITUDE_REGULATION_OF_OSCILLATION_ENABLED</name>
                  <description>Internal crystal oscillator enabled; amplitude regulation of oscillation enabled.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
